// Copyright (c) Qualcomm Atheros, Inc.
// All rights reserved.
// Redistribution and use in source and binary forms, with or without modification, are permitted (subject to
// the limitations in the disclaimer below) provided that the following conditions are met:
//
// · Redistributions of source code must retain the above copyright notice, this list of conditions and the
//   following disclaimer.
// · Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
//   following disclaimer in the documentation and/or other materials provided with the distribution.
// · Neither the name of nor the names of its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE. THIS SOFTWARE IS
// PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,
// BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
// INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
// ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//==============================================================================
// Author(s): ="Atheros"
//==============================================================================

#ifndef __TARGADDRS_H__
#define __TARGADDRS_H__

#include "bmi_msg.h"

/*
 * AR6K option bits, to enable/disable various features.
 * By default, all option bits are 0.
 * These bits can be set in LOCAL_SCRATCH register 0.
 */
#define AR6K_OPTION_BMI_DISABLE 0x01   /* Disable BMI comm with Host */
#define AR6K_OPTION_SERIAL_ENABLE 0x02 /* Enable serial port msgs */
#define AR6K_OPTION_WDT_DISABLE 0x04   /* WatchDog Timer override */
#define AR6K_OPTION_SLEEP_DISABLE 0x08 /* Disable system sleep */
#define AR6K_OPTION_STOP_BOOT 0x10     /* Stop boot processes (for ATE) */
#define AR6K_OPTION_ENABLE_NOANI 0x20  /* Operate without ANI */
#define AR6K_OPTION_DSET_DISABLE 0x40  /* Ignore DataSets */
#define AR6K_OPTION_IGNORE_FLASH 0x80  /* Ignore flash during bootup */

/*
 * xxx_HOST_INTEREST_ADDRESS is the address in Target RAM of the
 * host_interest structure.  It must match the address of the _host_interest
 * symbol (see linker script).
 *
 * Host Interest is shared between Host and Target in order to coordinate
 * between the two, and is intended to remain constant (with additions only
 * at the end) across software releases.
 *
 * All addresses are available here so that it's possible to
 * write a single binary that works with all Target Types.
 * May be used in assembler code as well as C.
 */

#define AR4100_HOST_INTEREST_ADDRESS 0x00540600
#define AR4002_HOST_INTEREST_ADDRESS 0x00428800

#if ATH_FIRMWARE_TARGET == TARGET_AR4100_REV2
#define HOST_INTEREST ((uint32_t *)AR4100_HOST_INTEREST_ADDRESS)
#define HOST_INTEREST_MAX_SIZE 0x100
#elif ATH_FIRMWARE_TARGET == TARGET_AR400X_REV1
#define HOST_INTEREST ((uint32_t *)AR4002_HOST_INTEREST_ADDRESS)
#define HOST_INTEREST_MAX_SIZE 0x200
#endif

#if !defined(__ASSEMBLER__)
struct register_dump_s;
struct dbglog_hdr_s;

/*
 * These are items that the Host may need to access
 * via BMI or via the Diagnostic Window. The position
 * of items in this structure must remain constant
 * across firmware revisions!
 *
 * Types for each item must be fixed size across
 * target and host platforms.
 *
 * More items may be added at the end.
 */
struct host_interest_s
{
    /*
     * Pointer to application-defined area, if any.
     * Set by Target application during startup.
     */
    uint32_t hi_app_host_interest; /* 0x00 */

    /* Pointer to register dump area, valid after Target crash. */
    uint32_t hi_failure_state; /* 0x04 */

    /* Pointer to debug logging header */
    uint32_t hi_dbglog_hdr; /* 0x08 */

    /* Indicates whether or not flash is present on Target.
     * NB: flash_is_present indicator is here not just
     * because it might be of interest to the Host; but
     * also because it's set early on by Target's startup
     * asm code and we need it to have a special RAM address
     * so that it doesn't get reinitialized with the rest
     * of data.
     */
    uint32_t hi_flash_is_present; /* 0x0c */

    /*
     * General-purpose flag bits, similar to AR6000_OPTION_* flags.
     * Can be used by application rather than by OS.
     */
    uint32_t hi_option_flag; /* 0x10 */

    /*
     * Boolean that determines whether or not to
     * display messages on the serial port.
     */
    uint32_t hi_serial_enable; /* 0x14 */

    /* Start address of Flash DataSet index, if any */
    uint32_t hi_dset_list_head; /* 0x18 */

    /* Override Target application start address */
    uint32_t hi_app_start; /* 0x1c */

    /* Clock and voltage tuning */
    uint32_t hi_skip_clock_init;          /* 0x20 */
    uint32_t hi_core_clock_setting;       /* 0x24 */
    uint32_t hi_cpu_clock_setting;        /* 0x28 */
    uint32_t hi_system_sleep_setting;     /* 0x2c */
    uint32_t hi_xtal_control_setting;     /* 0x30 */
    uint32_t hi_pll_ctrl_setting_24ghz;   /* 0x34 */
    uint32_t hi_pll_ctrl_setting_5ghz;    /* 0x38 */
    uint32_t hi_ref_voltage_trim_setting; /* 0x3c */
    uint32_t hi_clock_info;               /* 0x40 */

    /*
     * Flash configuration overrides, used only
     * when firmware is not executing from flash.
     * (When using flash, modify the global variables
     * with equivalent names.)
     */
    uint32_t hi_bank0_addr_value;   /* 0x44 */
    uint32_t hi_bank0_read_value;   /* 0x48 */
    uint32_t hi_bank0_write_value;  /* 0x4c */
    uint32_t hi_bank0_config_value; /* 0x50 */

    /* Pointer to Board Data  */
    uint32_t hi_board_data; /* 0x54 */

    /*
     * Indication of Board Data state:
     *    0: board data is not yet initialized.
     *    1: board data is initialized; unknown size
     *   >1: number of bytes of initialized board data (varies with board type)
     */
    uint32_t hi_board_data_initialized; /* 0x58 */

    uint32_t hi_dset_RAM_index_table; /* 0x5c */

    uint32_t hi_desired_baud_rate;  /* 0x60 */
    uint32_t hi_dbglog_config;      /* 0x64 */
    uint32_t hi_end_RAM_reserve_sz; /* 0x68 */
    uint32_t hi_mbox_io_block_sz;   /* 0x6c */

    uint32_t hi_num_bpatch_streams;   /* 0x70 -- unused */
    uint32_t hi_mbox_isr_yield_limit; /* 0x74 */

    uint32_t hi_refclk_hz;                /* 0x78 */
    uint32_t hi_ext_clk_detected;         /* 0x7c */
    uint32_t hi_dbg_uart_txpin;           /* 0x80 */
    uint32_t hi_dbg_uart_rxpin;           /* 0x84 */
    uint32_t hi_hci_uart_baud;            /* 0x88 */
    uint32_t hi_hci_uart_pin_assignments; /* 0x8C */
    /* NOTE: byte [0] = tx pin, [1] = rx pin, [2] = rts pin, [3] = cts pin */
    uint32_t hi_hci_uart_baud_scale_val; /* 0x90 */
    uint32_t hi_hci_uart_baud_step_val;  /* 0x94 */

    uint32_t hi_allocram_start;        /* 0x98 */
    uint32_t hi_allocram_sz;           /* 0x9c */
    uint32_t hi_hci_bridge_flags;      /* 0xa0 */
    uint32_t hi_hci_uart_support_pins; /* 0xa4 */
    /* NOTE: byte [0] = RESET pin (bit 7 is polarity), bytes[1]..bytes[3] are for future use */
    uint32_t hi_hci_uart_pwr_mgmt_params; /* 0xa8 */
                                          /* 0xa8 - [0]: 1 = enable, 0 = disable
                                           *        [1]: 0 = UART FC active low, 1 = UART FC active high
                                           * 0xa9 - [7:0]: wakeup timeout in ms
                                           * 0xaa, 0xab - [15:0]: idle timeout in ms
                                           */
    /* Pointer to extended board Data  */
    uint32_t hi_board_ext_data;        /* 0xac */
    uint32_t hi_board_ext_data_config; /* 0xb0 */
                                       /*
                                        * Bit [0]  :   valid
                                        * Bit[31:16:   size
                                        */
    /*
      * hi_reset_flag is used to do some stuff when target reset.
      * such as restore app_start after warm reset or
      * preserve host Interest area, or preserve ROM data, literals etc.
      */
    uint32_t hi_reset_flag; /* 0xb4 */
    /* indicate hi_reset_flag is valid */
    uint32_t hi_reset_flag_valid;             /* 0xb8 */
    uint32_t hi_hci_uart_pwr_mgmt_params_ext; /* 0xbc */
                                              /* 0xbc - [31:0]: idle timeout in ms
                                               */
    /* ACS flags */
    uint32_t hi_acs_flags;     /* 0xc0 */
    uint32_t hi_console_flags; /* 0xc4 */
    uint32_t hi_nvram_state;   /* 0xc8 */
    uint32_t hi_option_flag2;  /* 0xcc */

    /* If non-zero, override values sent to Host in WMI_READY event. */
    uint32_t hi_sw_version_override;  /* 0xd0 */
    uint32_t hi_abi_version_override; /* 0xd4 */
                                      /* Percentage of high priority RX traffic to total expected RX traffic -
                                       * applicable only to ar6004 */
    uint32_t hi_hp_rx_traffic_ratio;  /* 0xd8 */

    /* test applications flags */
    uint32_t hi_test_apps_related; /* 0xdc */
    /* location of test script */
    uint32_t hi_ota_testscript; /* 0xe0 */
    /* location of CAL data */
    uint32_t hi_cal_data; /* 0xe4 */

    /* Number of packet log buffers */
    uint32_t hi_pktlog_num_buffers; /* 0xe8 */

    /* wow extension configuration */
    uint32_t hi_wow_ext_config; /* 0xec */

    uint32_t hi_pwr_save_flags; /*  0xf0 */

    /* Spatial Multiplexing Power Save (SMPS) options */
    uint32_t hi_smps_options; /* 0xf4 */
    /* rx coalescing filter configuration */
    uint32_t hi_rx_coalesce_filter_config; /* 0xf8 */

    uint32_t hi_bt_sharing_info; /* 0xfc */

#if (HOST_INTEREST_MAX_SIZE > 0x100)

    uint32_t hi_i2c_slv_cfg; /* 0x100 */

    uint32_t hi_reserved_3; /* 0x104*/
    uint32_t hi_reserved_4; /* 0x108 */
    uint32_t hi_reserved_5; /* 0x10c */
    uint32_t hi_reserved_6; /* 0x110 */

    /* RTOS-specific pointer-sized value */
    uint32_t hi_rtos; /* 0x114 */

    /* Extending General purpose Flags */
    uint32_t hi_option_flag3; /* 0x118 */
#endif                        /*HOST_INTEREST_MAX_SIZE*/
};

/* bitmap for hi_test_apps_related */
#define HI_TEST_APPS_TESTSCRIPT_LOADED 0x00000001
#define HI_TEST_APPS_CAL_DATA_AVAIL 0x00000002
#define HI_TEST_APPS_ENABLE_WHCK_LOG 0x00000004

/* Bits defined in hi_option_flag */
#define HI_OPTION_TIMER_WAR 0x01         /* Enable timer workaround */
#define HI_OPTION_BMI_CRED_LIMIT 0x02    /* Limit BMI command credits */
#define HI_OPTION_RELAY_DOT11_HDR 0x04   /* Relay Dot11 hdr to/from host */
#define HI_OPTION_MAC_ADDR_METHOD 0x08   /* MAC addr method 0-locally administred 1-globally unique addrs */
#define HI_OPTION_FW_BRIDGE 0x10         /* Firmware Bridging */
#define HI_OPTION_ENABLE_PROFILE 0x20    /* Enable CPU profiling */
#define HI_OPTION_DISABLE_DBGLOG 0x40    /* Disable debug logging */
#define HI_OPTION_SKIP_ERA_TRACKING 0x80 /* Skip Era Tracking */
#define HI_OPTION_PAPRD_DISABLE 0x100    /* Disable PAPRD (debug) */
